# Задача 1:
# Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих
# строках записаны N целых чисел Ai. Последняя строка содержит число X

# N = int(input("Введите количество элементов в массиве: "))
# N_elem = input("Введите список элементов через пробел: ").split()
# X = int(input("Введите число, которе встречается в массиве: "))

# A = list(map(int, N_elem))
# count = 0

# for i in range(0, len(N_elem)):
#     if A[i] == X:
#         count += 1
# print(count)